tests/com/l7tech/service/resources/PlaceOrder_with_XmlRequestSecurity.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope
    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header>
        <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2002/xx/secext">
            <wsse:SecurityContextToken>
                <wsu:Identifier xmlns:wsu="http://schemas.xmlsoap.org/ws/2002/07/utility">275460303971593271</wsu:Identifier>
                <l7:SeqNr xmlns:l7="http://l7tech.com/ns/msgseqnr">14</l7:SeqNr>
            </wsse:SecurityContextToken>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#signref1">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>dvOxeYoiNuoXoDmyBdEnWNlM3dQ=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>d8zzz/LWX5nu96trd9DWGU21xTRJhAmpdzObe3NpVB+KHoB8EO7XNGhIl3yYJn3Lm1rg4pFJNwc65yByjHxG3hO72dj/P7XdtO3huQ3mKnduiKiMP4fg0fNU/lkPS4ibvgKs4Dg+AF1/j8sRocWPzL313C+v4PUlRkrQIKup5OA=</ds:SignatureValue>
                <ds:KeyInfo>
                    <ds:X509Data>
                        <ds:X509IssuerSerial>
                            <ds:X509IssuerName>CN=root.locutus.l7tech.com</ds:X509IssuerName>
                            <ds:X509SerialNumber>8238169826298403580</ds:X509SerialNumber>
                        </ds:X509IssuerSerial>
                        <ds:X509SKI>fgz0zDMKgnvRtwZOxqcO4b3Azgg=</ds:X509SKI>
                        <ds:X509SubjectName>CN=alex</ds:X509SubjectName>

                        <ds:X509Certificate>MIICEDCCAXmgAwIBAgIIclPbzy/bmvwwDQYJKoZIhvcNAQEFBQAwIjEgMB4GA1UEAxMXcm9vdC5s
                            b2N1dHVzLmw3dGVjaC5jb20wHhcNMDQwMzMxMjIyMjU1WhcNMDYwMzMxMjIzMjU1WjAPMQ0wCwYD
                            VQQDEwRhbGV4MIGdMA0GCSqGSIb3DQEBAQUAA4GLADCBhwKBgQCRAahBK+DceJsqndB3ZN7U4CG3
                            25jMvRYJLRmVNfBwhed5PT7mnlpBCwxrx+U5d8sEOuc02CAq2qIoAupVNEBtJrwRVnlLcPsVgYbo
                            TK2zJFplUFjlDKH/q5gDZO8pG0UqP9HdMKdm/V6JPd5kLc5pFSDXozgZORs2x0yl50pTZwIBEaNk
                            MGIwDwYDVR0TAQH/BAUwAwEBADAPBgNVHQ8BAf8EBQMDB6AAMB0GA1UdDgQWBBR+DPTMMwqCe9G3
                            Bk7Gpw7hvcDOCDAfBgNVHSMEGDAWgBScfxfUJeD+dDOvgtX95a+OkkV25TANBgkqhkiG9w0BAQUF
                            AAOBgQCFkFqi8zieOCtHsSB9SqE/1QlYXV606Oyodirvs1fZSRvcFLNZL0yDcfvAnVITxWk8tpXk
                            6uqqZLgwuQczYJAtj6vk/ik+y+1JnWusjWJLnROv0F5bvPJvaBpVzZfYEDDrHnxQ7kydsrmhgYn0 2xtXs9Cn7ouYKYt7wZMi2WLMUw==</ds:X509Certificate>
                    </ds:X509Data>
                </ds:KeyInfo>
            </ds:Signature>
            <xenc:ReferenceList>
                <xenc:DataReference URI="encref1"/>
            </xenc:ReferenceList>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#signref2">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>jGicKa6tuHfSSLrPk9I3SnRDBgE=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>RQ29fU0HIN41lRP6BCtywir70r+1e0At6PKia4KPtJ3lOXw//5NycqVCi6ZqZaN0k6Ze99YUeNcgZjN1dt49JNjo5Na8F+vF2gEaxVhc62ggG44HlwKXWaM76KjVBk2+Hzrco5qYtDKDEEII5FC3eMg8zfrZ3TxM9HMeG0RQzmk=</ds:SignatureValue>
                <ds:KeyInfo>
                    <ds:X509Data>
                        <ds:X509IssuerSerial>
                            <ds:X509IssuerName>CN=root.locutus.l7tech.com</ds:X509IssuerName>
                            <ds:X509SerialNumber>8238169826298403580</ds:X509SerialNumber>
                        </ds:X509IssuerSerial>
                        <ds:X509SKI>fgz0zDMKgnvRtwZOxqcO4b3Azgg=</ds:X509SKI>
                        <ds:X509SubjectName>CN=alex</ds:X509SubjectName>

                        <ds:X509Certificate>MIICEDCCAXmgAwIBAgIIclPbzy/bmvwwDQYJKoZIhvcNAQEFBQAwIjEgMB4GA1UEAxMXcm9vdC5s
                            b2N1dHVzLmw3dGVjaC5jb20wHhcNMDQwMzMxMjIyMjU1WhcNMDYwMzMxMjIzMjU1WjAPMQ0wCwYD
                            VQQDEwRhbGV4MIGdMA0GCSqGSIb3DQEBAQUAA4GLADCBhwKBgQCRAahBK+DceJsqndB3ZN7U4CG3
                            25jMvRYJLRmVNfBwhed5PT7mnlpBCwxrx+U5d8sEOuc02CAq2qIoAupVNEBtJrwRVnlLcPsVgYbo
                            TK2zJFplUFjlDKH/q5gDZO8pG0UqP9HdMKdm/V6JPd5kLc5pFSDXozgZORs2x0yl50pTZwIBEaNk
                            MGIwDwYDVR0TAQH/BAUwAwEBADAPBgNVHQ8BAf8EBQMDB6AAMB0GA1UdDgQWBBR+DPTMMwqCe9G3
                            Bk7Gpw7hvcDOCDAfBgNVHSMEGDAWgBScfxfUJeD+dDOvgtX95a+OkkV25TANBgkqhkiG9w0BAQUF
                            AAOBgQCFkFqi8zieOCtHsSB9SqE/1QlYXV606Oyodirvs1fZSRvcFLNZL0yDcfvAnVITxWk8tpXk
                            6uqqZLgwuQczYJAtj6vk/ik+y+1JnWusjWJLnROv0F5bvPJvaBpVzZfYEDDrHnxQ7kydsrmhgYn0 2xtXs9Cn7ouYKYt7wZMi2WLMUw==</ds:X509Certificate>
                    </ds:X509Data>
                </ds:KeyInfo>
            </ds:Signature>
            <xenc:ReferenceList>
                <xenc:DataReference URI="encref2"/>
            </xenc:ReferenceList>
            <ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
                <ds:SignedInfo>
                    <ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                    <ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <ds:Reference URI="#signref3">
                        <ds:Transforms>
                            <ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
                            <ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
                        </ds:Transforms>
                        <ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <ds:DigestValue>wXtrmrj1S43RT8l0bhLpXbsTrSM=</ds:DigestValue>
                    </ds:Reference>
                </ds:SignedInfo>
                <ds:SignatureValue>QAjYoorMYcB+GB6+3nxfLECVevwjK/SZ37S7y652EnVWHNfwXCZngoiBg6d63bbRNePACFVyZy/yqeCacP0CZ1BTv/31xgTeArSdC3rsszsJqXdHYM7Xv6ssa7+000KRqLvAGom8Kr6dfTe0vameg/AR5vRI8hgVYNxwcbsG0QE=</ds:SignatureValue>
                <ds:KeyInfo>
                    <ds:X509Data>
                        <ds:X509IssuerSerial>
                            <ds:X509IssuerName>CN=root.locutus.l7tech.com</ds:X509IssuerName>
                            <ds:X509SerialNumber>8238169826298403580</ds:X509SerialNumber>
                        </ds:X509IssuerSerial>
                        <ds:X509SKI>fgz0zDMKgnvRtwZOxqcO4b3Azgg=</ds:X509SKI>
                        <ds:X509SubjectName>CN=alex</ds:X509SubjectName>

                        <ds:X509Certificate>MIICEDCCAXmgAwIBAgIIclPbzy/bmvwwDQYJKoZIhvcNAQEFBQAwIjEgMB4GA1UEAxMXcm9vdC5s
                            b2N1dHVzLmw3dGVjaC5jb20wHhcNMDQwMzMxMjIyMjU1WhcNMDYwMzMxMjIzMjU1WjAPMQ0wCwYD
                            VQQDEwRhbGV4MIGdMA0GCSqGSIb3DQEBAQUAA4GLADCBhwKBgQCRAahBK+DceJsqndB3ZN7U4CG3
                            25jMvRYJLRmVNfBwhed5PT7mnlpBCwxrx+U5d8sEOuc02CAq2qIoAupVNEBtJrwRVnlLcPsVgYbo
                            TK2zJFplUFjlDKH/q5gDZO8pG0UqP9HdMKdm/V6JPd5kLc5pFSDXozgZORs2x0yl50pTZwIBEaNk
                            MGIwDwYDVR0TAQH/BAUwAwEBADAPBgNVHQ8BAf8EBQMDB6AAMB0GA1UdDgQWBBR+DPTMMwqCe9G3
                            Bk7Gpw7hvcDOCDAfBgNVHSMEGDAWgBScfxfUJeD+dDOvgtX95a+OkkV25TANBgkqhkiG9w0BAQUF
                            AAOBgQCFkFqi8zieOCtHsSB9SqE/1QlYXV606Oyodirvs1fZSRvcFLNZL0yDcfvAnVITxWk8tpXk
                            6uqqZLgwuQczYJAtj6vk/ik+y+1JnWusjWJLnROv0F5bvPJvaBpVzZfYEDDrHnxQ7kydsrmhgYn0 2xtXs9Cn7ouYKYt7wZMi2WLMUw==</ds:X509Certificate>
                    </ds:X509Data>
                </ds:KeyInfo>
            </ds:Signature>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <ns1:placeOrder
            soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://warehouse.acme.com/ws">
            <productid Id="signref1" xsi:type="xsd:long">4130951631568470821</productid>
            <amount Id="signref2" xsi:type="xsd:long">
                <EncryptedData Id="encref1" xmlns="http://www.w3.org/2001/04/xmlenc#">
                    <EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
                    <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <KeyName>275460303971593271</KeyName>
                    </KeyInfo>
                    <CipherData>
                        <CipherValue>wF76lo5v6t6NRexeAZmiV9TNd8L/hK3JsT8g6ANEQyU=</CipherValue>
                    </CipherData>
                </EncryptedData>
            </amount>
            <price Id="signref3" xsi:type="xsd:float">
                <EncryptedData Id="encref2" xmlns="http://www.w3.org/2001/04/xmlenc#">
                    <EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc"/>
                    <KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
                        <KeyName>275460303971593271</KeyName>
                    </KeyInfo>
                    <CipherData>
                        <CipherValue>hm1LnAMr78BiZPV9LwB1nudzIEe6iKz/XvhHDWHbNY4=</CipherValue>
                    </CipherData>
                </EncryptedData>
            </price>
            <accountid xsi:type="xsd:long">228</accountid>
        </ns1:placeOrder>
    </soapenv:Body>
</soapenv:Envelope>
